
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Описание обязательных методов драйвера на Английском

Функция GetInterfaceRevision() Экспорт
	
	Возврат ПолучитьРевизиюИнтерфейса();	

КонецФункции

Функция GetDescription(ОписаниеДрайвера) Экспорт

	Возврат ПолучитьОписание(ОписаниеДрайвера);

КонецФункции

// Описание обязательных методов драйвера на Английском

Функция ПолучитьРевизиюИнтерфейса() Экспорт

	Возврат 3007;

КонецФункции

Функция ПолучитьОписание(ОписаниеДрайвера) Экспорт

	ОписаниеДрайвера= Новый Структура;
	ОписаниеДрайвера.Вставить("Name",							"Драйвер экрана покупателя");
	ОписаниеДрайвера.Вставить("Description",					"Программная компонента взаимодействия с рекламным процессингом ЛОТРЗ");
	ОписаниеДрайвера.Вставить("EquipmentType",					"ДисплейПокупателя");
	ОписаниеДрайвера.Вставить("IntegrationComponent",			Ложь);
	ОписаниеДрайвера.Вставить("MainDriverInstalled",			Истина);
	ОписаниеДрайвера.Вставить("DriverVersion",					"1.1.1 от 14.07.2022");
	ОписаниеДрайвера.Вставить("IntegrationComponentVersion",	"1.1.1 от 14.07.2022");
	ОписаниеДрайвера.Вставить("DownloadURL",					"");
	ОписаниеДрайвера.Вставить("LogIsEnabled",					Ложь);
	ОписаниеДрайвера.Вставить("LogPath",						"");
	
	ОписаниеДрайвера = ОбщегоНазначения.ЗначениеВСтрокуXML(ОписаниеДрайвера);
	
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
