
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

 Перем ДанныеОшибки;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Описание обязательных методов драйвера на Английском

Функция GetInterfaceRevision() Экспорт
	
	Возврат ПолучитьРевизиюИнтерфейса();	

КонецФункции

Функция GetDescription(ОписаниеДрайвера) Экспорт

	Возврат ПолучитьОписание(ОписаниеДрайвера);

КонецФункции

Функция GetLastError(ОписаниеОшибки) Экспорт

	Возврат ПолучитьОшибку(ОписаниеОшибки);

КонецФункции

Функция GetParameters(СписокПараметров) Экспорт
	
	Возврат ПолучитьПараметры(СписокПараметров);
	
КонецФункции

// Описание обязательных методов драйвера на Английском

Функция ПолучитьРевизиюИнтерфейса() Экспорт

	Возврат 3007;

КонецФункции

Функция ПолучитьОписание(ОписаниеДрайвера) Экспорт

	Операция = "Получение описание драйвера";

	ОписаниеДрайвера= Новый Структура;
	ОписаниеДрайвера.Вставить("Name",							"Драйвер экрана покупателя");
	ОписаниеДрайвера.Вставить("Description",					"Программная компонента взаимодействия с рекламным процессингом ЛОТРЗ");
	ОписаниеДрайвера.Вставить("EquipmentType",					"ДисплейПокупателя");
	ОписаниеДрайвера.Вставить("IntegrationComponent",			Ложь);
	ОписаниеДрайвера.Вставить("MainDriverInstalled",			Истина);
	ОписаниеДрайвера.Вставить("DriverVersion",					"1.1.1 от 14.07.2022");
	ОписаниеДрайвера.Вставить("IntegrationComponentVersion",	"1.1.1 от 14.07.2022");
	ОписаниеДрайвера.Вставить("DownloadURL",					"");
	ОписаниеДрайвера.Вставить("LogIsEnabled",					Ложь);
	ОписаниеДрайвера.Вставить("LogPath",						"");
	
	Попытка
		ОписаниеДрайвера = ОбщегоНазначения.ЗначениеВСтрокуXML(ОписаниеДрайвера);
	Исключение
		УстановитьОшибку(Операция,Строка(ОписаниеОшибки()),Истина);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции

Функция ПолучитьОшибку(ОписаниеОшибки) Экспорт

	ОписаниеОшибки = ДанныеОшибки.Описание;
	Возврат ДанныеОшибки.Код;

КонецФункции

Функция ПолучитьПараметры(СписокПараметров) Экспорт
	
	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОшибку(Знач Операция,Знач Описание="",Знач ЕстьОшибка=Ложь);
	
	Если НЕ ЗначениеЗаполнено(Описание) Тогда
		Описание = ?(ЕстьОшибка,"Ошибка при выполнение операции.","Операция успешно выполнена");
	КонецЕсли;
	Описание = Операция + ": " + Строка(Описание);
	
	ДанныеОшибки.Описание	= Описание;
	ДанныеОшибки.Код		= ?(ЕстьОшибка,-1,0);
	
КонецПроцедуры


#КонецОбласти

#Область Инициализация

	ДанныеОшибки = Новый Структура("Описание,Код","",0);

#КонецОбласти

#КонецЕсли
