
&НаКлиенте
Процедура ОткрытьДопФорму(Команда)

	ОткрытьДопФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОткрытьДопФормуНаСервере()

	Драйвер = РеквизитФормыВЗначение("Объект");	
	Драйвер.ЗапуститьДопФорму();
	ЗначениеВРеквизитФормы(Драйвер,"Объект");

//	Драйвер = ДанныеФормыВЗначение(Объект,);	
//	Драйвер.ЗапуститьДопФорму();
//	ЗначениеВДанныеФормы(Драйвер,Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Объект.ТестовыйРеквизит = "НА КЛИЕНТЕ";

КонецПроцедуры

