
&НаКлиенте
Процедура ВыполнитьТест(Команда)

	ВыполнитьТестНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОткрытьФорму("ОкноПокупателя",
		Новый Структура("Экран",Объект.Экран),ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьТестНаСервере()

	Драйвер = РеквизитФормыВЗначение("Объект");

	ДанныеВывода = Новый Структура;
	ДанныеВывода.Вставить("ТоварНаименование",	ЭтаФорма.ТоварНаименование);
	ДанныеВывода.Вставить("ТоварКоличество",	ЭтаФорма.ТоварКоличество);
	ДанныеВывода.Вставить("ТоварЦена",			ЭтаФорма.ТоварЦена);
	ДанныеВывода.Вставить("ТоварСумма",			ЭтаФорма.ТоварСумма);	

	Драйвер.ВывестиСтрокуНаДисплейПокупателя(ДанныеВывода);
	ЗначениеВРеквизитФормы(Драйвер,"Объект");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаФорма.ТоварНаименование	= "Любой товар в аптеке";
	ЭтаФорма.ТоварКоличество	= 3;
	ЭтаФорма.ТоварЦена			= 120;
	ЭтаФорма.ТоварСумма			= ЭтаФорма.ТоварКоличество * ЭтаФорма.ТоварЦена;

КонецПроцедуры

