
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//СтрокаHTML = "www.twitch.tv";
	
	ПодключитьОбработчикОжидания("ТестПоля",3,Ложь);
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ВернутьЛистинг()
	
	HTMLТекст =		"<html>
					|<head>
					|</head>
					|<body>
					|<p><ЭтоПараметр></p>
    				|</body>
    				|</html>";
	
	HTMLТекст = СтрЗаменить(HTMLТекст,"<ЭтоПараметр>",Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd; ДЛФ=DDT;")
					 + " " + Строка(Новый УникальныйИдентификатор()));
					
	Возврат HTMLТекст;
	
КонецФункции 

&НаКлиенте
Процедура ТестПоля() Экспорт

	СтрокаHTML = ВернутьЛистинг();		
	
КонецПроцедуры